<a href="https://colab.research.google.com/github/Jessy0786/Mujeres-Digitales-Jessy/blob/main/Series_Informaci%C3%B3n_adicional.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Como cargar un archivo en csv y un excell

In [16]:
import pandas as pd
pokemones= pd.read_csv('sample_data/pokemon_data.csv')
pokemones.head(3)

   #       Name Type 1  Type 2  ...  Sp. Def  Speed  Generation  Legendary
0  1  Bulbasaur  Grass  Poison  ...       65     45           1      False
1  2    Ivysaur  Grass  Poison  ...       80     60           1      False
2  3   Venusaur  Grass  Poison  ...      100     80           1      False

[3 rows x 12 columns]

In [14]:
import numpy as np
z= pd.read_excel('sample_data/Libro1.xlsx')
print(z)
z.head(3)

   wdawd awdawd awdawd.1 wdawd.1
0  dwdwd  dwdaw    dwdwa   wdawd
1  rgggg   hhhh      jjj    jjjj

   wdawd awdawd awdawd.1 wdawd.1
0  dwdwd  dwdaw    dwdwa   wdawd
1  rgggg   hhhh      jjj    jjjj

# Filtros basicos

In [ ]:
#Filtros generales ------ informacion adicional
visitas= pd.read_excel('sample_data/VIsitas.xlsx')
print(visitas)
print('-------------------Comando para imprimir determinado numero de filas--------------')
#comando para imprimir determinado numero de filas(en este caso puse 5, pueden ser las que uno quiera)
print(visitas.head(5))
print('----------Nos dice cuantas columnas y cuantas filas tiene el dataframe------------')
print('------------------------En este caso son 11 filas, 4 columnas----------------------')
print(visitas.shape)
print('------------------- Imprimir la lista de columnas que tiene el dataframe--------------')
print(list(visitas))
print('------------------- Imprimir el nombre y el tipo de datos de las columnas --------------')
print(visitas.dtypes)

In [ ]:
print('----------------mostrar el contenido de una columna-------------------')
print(visitas['PaisesVisitado'])

In [ ]:
# mostrar el contenido de varias columnas (se imprimen en el orden que uno las ponga)
print(visitas[['PaisesVisitado','PueblosNoVisitados','Pueblos visitados' ]])

In [ ]:
#seleccionar los primeros renglones(filas) del dataframe
print(visitas[:3])

In [ ]:
#seleccionar la ultima filas del dataframe
print(visitas[-1:])

# Escribir archivo csv

In [19]:
# Crear archivo desde cero
import csv

with open('exampleEDUARDO.csv', 'w') as csvfile:
    fieldnames = ['first_name', 'last_name', 'Grade']
    writer = csv.DictWriter(csvfile, fieldnames=fieldnames)
 
    writer.writeheader()
    writer.writerow({'Grade': 'B', 'first_name': 'Eduardo', 'last_name': 'Brian'})
    writer.writerow({'Grade': 'A', 'first_name': 'Rachael','last_name': 'Rodriguez'})
    writer.writerow({'Grade': 'B', 'first_name': 'Jane', 'last_name': 'Oscar'})
    writer.writerow({'Grade': 'B', 'first_name': 'Jane', 'last_name': 'Loive'})
 
print("Writing complete")
algo1= pd.read_csv('/content/exampleEDUARDO.csv')
algo1

Writing complete

  first_name  last_name Grade
0    Eduardo      Brian     B
1    Rachael  Rodriguez     A
2       Jane      Oscar     B
3       Jane      Loive     B

In [17]:
print(pokemones[['Generation','Name','Type 1']])
import numpy as np

     Generation                   Name   Type 1
0             1              Bulbasaur    Grass
1             1                Ivysaur    Grass
2             1               Venusaur    Grass
3             1  VenusaurMega Venusaur    Grass
4             1             Charmander     Fire
..          ...                    ...      ...
795           6                Diancie     Rock
796           6    DiancieMega Diancie     Rock
797           6    HoopaHoopa Confined  Psychic
798           6     HoopaHoopa Unbound  Psychic
799           6              Volcanion     Fire

[800 rows x 3 columns]

In [22]:
#Crear un archivo apartir de otro
import csv
pdExample = pd.DataFrame(pokemones, columns = ['Generation', 'Name', 'Type 1'])
fieldnamesColumns = pdExample.columns.tolist()
with open('examplePokemon.csv', 'w') as csvfile:
  writer = csv.DictWriter(csvfile, fieldnames=fieldnamesColumns)
  writer.writeheader()
  for i in fieldnamesColumns:
    columna1=fieldnamesColumns[0]
    columna2=fieldnamesColumns[1]
    columna3=fieldnamesColumns[2]
  for index, row in pdExample.iterrows():   
    writer.writerow({columna1: row[columna1], columna2: row[columna2], columna3: row[columna3]})    
 
print("Writing complete")
pokeExp= pd.read_csv('/content/examplePokemon.csv')
pokeExp

Writing complete

     Generation                   Name   Type 1
0             1              Bulbasaur    Grass
1             1                Ivysaur    Grass
2             1               Venusaur    Grass
3             1  VenusaurMega Venusaur    Grass
4             1             Charmander     Fire
..          ...                    ...      ...
795           6                Diancie     Rock
796           6    DiancieMega Diancie     Rock
797           6    HoopaHoopa Confined  Psychic
798           6     HoopaHoopa Unbound  Psychic
799           6              Volcanion     Fire

[800 rows x 3 columns]

In [23]:
#Exportar Dataframe a csv
pdExample = pd.DataFrame(pokemones, columns = ['Generation', 'Name', 'Type 1'])
pdExample.to_csv("examplePokemo2n.csv", index=False)
pokeExp2= pd.read_csv('/content/examplePokemo2n.csv')
pokeExp2

     Generation                   Name   Type 1
0             1              Bulbasaur    Grass
1             1                Ivysaur    Grass
2             1               Venusaur    Grass
3             1  VenusaurMega Venusaur    Grass
4             1             Charmander     Fire
..          ...                    ...      ...
795           6                Diancie     Rock
796           6    DiancieMega Diancie     Rock
797           6    HoopaHoopa Confined  Psychic
798           6     HoopaHoopa Unbound  Psychic
799           6              Volcanion     Fire

[800 rows x 3 columns]